# 1. Дано рядок.
my_str = str(input("Введіть щось:"))
#      a. виведіть третій символ цього рядка.
# print(my_str[2:3])
#      b. виведіть передостанній символ цього рядка.
# print(my_str[-2:-1])
#      c. виведіть перші п'ять символів цього рядка.
# print(my_str[0:5])
#      d. виведіть весь рядок, крім двох останніх символів.
# print(my_str[:-2])
#      e. виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться
#      починаючиз першого).
# print(my_str[::2])
#      f. виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
# print(my_str[1::2])
#      g. виведіть усі символи у зворотному порядку.
# print(my_str[::-1])
#      h. виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
# print(my_str[-1::-2])
#      i. виведіть довжину цього рядка.
# print(len(my_str))
#
# 2. Дано рядок, що складається зі слів, розділених пробілами. Визначте, скільки у ній слів. Використовуйте для
# вирішення завдання функцію `count`
# x = my_str.count(" ") + 1
# print(x)
# 3. Користувач вводить окремо рядок `s` та один символ `ch`. Необхідно здійснити пошук у рядку `s` всіх символів `ch`.
# Для вирішення можна використовувати тільки функцію `find` (rfind), оператори `if` та `for` (while).

s = my_str
ch = input("Який символ знайти? ")
start = -1
count = 0

while True:
    start = my_str.find(ch, start+1)
    if start == -1:
        break
    count += 1

print("У рядку ", count, "символів ", ch)

# 11. Дано рядок. Замініть у цьому рядку всі появи літери `h` на літеру `H`, крім першого та останнього входження.
#
# x = my_str.find("h")
# y = my_str.rfind("h")
#
# my_str_0 = my_str[:x+1]
# my_str_1 = my_str[x+1:y]
# my_str_2 = my_str[y:]
#
# my_str_r = my_str_1.replace("h", "H")
# result = my_str_0 + my_str_r + my_str_2
# print(result)
