# Задання виконати в окремому файлі py. Усі пункти завдання відділити одне від одного коментарями. Завдання:
#
# 1) У вас є змінна величина, тип - int. Напишіть тернарний оператор для змінної new_value за таким правилом: якщо
#     значення менше 100, то new_value дорівнює половині значення, у протилежному випадку - протиположне
#     значенню число

new_value = int(input("Введи число:"))
new_value = new_value / 2 if new_value < 100 else new_value - (new_value * 2)
print(new_value)

#
# ########################################################
#
# 2) У вас є змінна величина, тип - int. Написати тернарний оператор для змінної new_value за таким правилом: якщо
#     значення менше 100, то new_value дорівнює 1, у протилежному випадку - 0

new_value = int(input("Введи число:"))
new_value = True if new_value < 100 else False
print(int(new_value))

#
# ########################################################
#
# 3) У вас є змінна величина, тип - int. Напишіть тернарний оператор для змінного new_value за таким правилом: якщо
#     значення менше 100, то new_value дорівнює True, у протилежному випадку - False

new_value = int(input("Введи число:"))
new_value = True if new_value < 100 else False
print(new_value)

#
# ########################################################
#
# 4) У вас є змінна my_str, тип - str. Якщо її довше менше 5, то допишіть в кінці строки її ж.
#     Приклад: було - "qwer", стало - "qwerqwer". Якщо довжина не менше 5, то залишити строку як є.

my_str = input("Напишіть щось:")
my_str = my_str*2 if len(my_str) < 5 else my_str
print(my_str)

#
# ########################################################
#
# 5) У вас є змінна my_str, тип - str. Якщо її довжина менше 5, то допишіть в кінці рядка перевернуту її ж.
#     Приклад: було - "qwer", стало - "qwerrewq". Якщо довжина не менше 5, то залишити строку як є.

my_str = input("Напишіть щось:")
my_str = my_str+my_str[::-1] if len(my_str) < 5 else my_str
print(my_str)


#
# ########################################################
#
# 6) Допрацювати завдання з калькулятором, щоб в кінці вичислення у користувача запитало, чи потрібен  калькулятор ще.
#   Якщо так, то запустити програму з початку.


first = 0
second = 0
act = 0
result = ""
again = "Так"

while again == "Так":
    try:
        first = float(input('Введіть перше число:'))
    except ValueError:
        try:
            first = float(input('Підходить тільки числове значення:'))
        except ValueError:
            print('Я так рахувати не вмію!')
            quit()
    act = input('Вкажіть математичну дію на вибір: "+" "-" "*" "/" "^"\nВаш вибір:')
    try:
        second = float(input('Введіть друге число:'))
    except ValueError:
        try:
            second = float(input('Підходить тільки числове значення:'))
        except ValueError:
            print('Я так рахувати не вмію!')
            quit()

    try:
        if act == '+':
            result = first + second
        elif act == '-':
            result = first - second
        elif act == '*':
            result = first * second
        elif act == '/':
            result = first / second
        elif act == "^":
            result = first ** second
        else:
            print("Неправильно обрана дія")
    except ArithmeticError:
        print("На нуль ділити не можна - всесвіт сколлапсується!")

    print(result)
    again = input("Якщо бажаєте продовжити напишіть 'Так':")